# Chapter 1 : Creating Your First Database and Table

We use SQL to define the structure of a table and how each table might relate to other tables in a database. We use SQL to extract, or *query* from tables.

Understanding tables is fundamental to understanding the data in your database. When working with a fresh database, look at the tables within. Look for clues in the table names and their column structure. Do the tables contain text, numbers, or both? How many rows are in each table? Look at how many tables are in the database.

## 1.1 Creating a Database
---

PostgreSQL is a *database management system* which allows you to define, manage, and query databases. When you install PostgreSQL, it creates a *database server*, an instance of the application running on your computer, that includes a default database called `postgres`. The database is a collection of objects that includes tables, functions, user roles, and much more.

We will be leaving this default database and create a new one. We'll do this to keep objects related to a particular topic or application organized together.

To create a database, use the keywords `CREATE` and `DATABASE`:
```
CREATE DATABASE analysis;
```
This creates a database named `analysis` using default PostgreSQL settings. The semicolon `;` ends all PostgreSQL statements and is part of the ANSI SQL standard.

## 1.2 Creating a Table
---

Let's take a look at the `CREATE TABLE` statement. The following table definition is far from comprehensive. It's missing several constraints that would ensure that columns must be filled do indeed have data or that we've not inadvertently entering duplicate values. These are omitted for now to focus on getting started:
```
CREATE TABLE teachers (             -- 1
    id bigserial,                   -- 2
    first_name varchar(25),         -- 3
    last_name varchar(50),          
    school varchar(50),             
    hire_date date,                 -- 4
    salary numeric                  -- 5
);                                  -- 6
```

#1 has two keywords `CREATE` AND `TABLE` along with the name `teachers`. Following is an open parenthesis and a comma-separated list of *column names* along with their data types.

#2 defines the `id` column with the datatype `bigserial` which is a special integer type that auto-increments every time you add a row to the table. The first row receives the value of 1 in the `id` column, the second 2, and so on. This is ***PostgreSQL specific***, but most database systems have a similar feature.

#3 creates columns for a teacher's first name, last name, the school where they teach. Each of these is of type `varchar`, a text column with a maximum length specified by the number in the parentheses.

#4 has data type `date` and #5 has data type `numeric` which will be covered in Chapter 3.

#6 wraps up the code block with the closing parenthesis and a semicolon.

## 1.3 Inserting Rows into a Table
---

To insert, make sure the query tool is empty. Then we can use the `INSERT` keyword.
```
INSERT INTO teachers (first_name, last_name, school, hire_date, salary)        -- 1
VALUES ('Janet', 'Smith', 'F.D. Roosevelt HS', '2011-10-30', 36200),           -- 2
       ('Lee', 'Reynolds', 'F.D. Roosevelt HS', '1993-05-22', 65000),
       ('Samuel', 'Cole', 'Myers Middle School', '2005-08-01', 43500),
       ('Samantha', 'Bush', 'Myers Middle School', '2011-10-30', 36200),
       ('Betty', 'Diaz', 'Myers Middle School', '2005-08-30', 43500),
       ('Kathleen', 'Roush', 'F.D. Roosevelt HS', '2010-10-22', 38500);        -- 3
```

This block code example inserts names and data for six teachers. 

#1 : Here, the PostgreSQL follows the ANSI SQL standard: after the `INSERT` `INTO` keywords is the name of the table, and in the parentheses are the columns to be filled.

#2 : The `VALUES` keyword and the data are inserted into each column in each row. You need to enclose the data for each row in a set of parentheses, and inside each set of parentheses , use a comma to separate each column value. The order of the values must match the order of the columns specified after the table name. Each row of data ends with a comma.

#3 : The last row ends the entire statement with a semicolon.

Note, text and dates require quotes while numbers such as integers and decimals do not. There is no data inserted for the `id` column because it is (recall) of data type `bigserial` which will automatically fill the `id` column with an auto-increasing integer.

## 1.4 Formatting SQL for Readability
---

No special formatting is required to run, but for the sake of readability and being a good coder, it's best to follow these conventions:
- **Uppercase SQL keywords** such as `SELECT`.
- **Avoid camel case** and instead use `lowercase_and_underscores` for object names, such as tables and column names
- **Indent clauses and code blocks** for readability using either two or four spaces (or tabs).

# Chapter 2 : Beginning Data Exploration with `SELECT`

## 2.1 Basic `SELECT` Syntax
---

Here's a `SELECT` statement that fetches every row and collumn in a table called `my_table`.
```
SELECT *
FROM my_table;
```

The `*` following `SELECT` is called a ***wildcard***. A wildcard is like a stand-in value: it doesn't represent anything in particular and represents everything that value could possibly be. Here, it is a shorthand for "all columns." If you had given a column name instead of the wildcard, the command would select values in that column.

The keyword `FROM` indicates you want the query to return data from a particular table.

## Querying a Subset of Columns

It is often more practical to limit the columns the query retrieves, especially with large databases. Do this by naming columns, separated by commas, after the `SELECT` keyword. For example:
```
SELECT some_column, another_column, other_column
FROM table_name;
```
The order that you list the columns will be the order they appear in the query.

This illustrates a good strategy for beginning your interview of a data set. It's wise to start your analysis by checking whether your data is present and in the format you expect. Are dates in a complete month-date-year format, or are they entered as text with month and year only? Does every row have a value? Are there mysteriously no last names starting with letters beyond "M"? All these issues indicate potential hazards ranging from missing data to shoddy recordkeeping somewhere in the workflow.

## Using `DISTINCT` to Find Unique Values

It's not unusual for a column to contain rows with duplicate values. To understand the range of values in a column, we can use the `DISTINCT` keyword as part of a query that eliminates duplicates and only shows unique values. Use the `DISTINCT` keyword right after `SELECT` :
```
SELECT DISTINCT school
FROM teachers;
```

The `DISTINCT` keyword also works on more than one column at a time. If we add a column, the query returns each unique pair of values.
```
SELECT DISTINCT school, salary
FROM teachers;
```
This would return each distinct salary earned at each school. If you enter this, you can see that it only returned 5 rows. This is because there are two teachers at Myers Middle School that earn $43,500.

This technique gives us the ability to ask, "For each $x$ in the table, what are all the $y$ values?"

## 2.2 Sorting Data with `ORDER BY`
---

Patterns are more easily revealed when data is arranged in order. We order results by using a clause containing the keywords `ORDER BY` followed by the column or columns to sort. Applying this clause doesn't change the original table, only the result of the query.
```
SELECT first_name, last_name, salary
FROM teachers
ORDER BY salary DESC;
```

By default, `ORDER BY` sorts values in *ascending* order, but here it is sorted in descending order using the keyword `DESC`. There is an optional `ASC` keyword for ascending. By ordering `salary` column from highest to lowest, we can see which teachers earn the most.

Ordering by numbers is intuitive, but by letters might not be considering captialization and punctuation. 

During PostgreSQL installation, the server is assigned a particular *locale* for *collation*, or odering of text, as well as a *character set*. Both are based either on settings in the computer's operatin system or custom options supplied during installation.

Based on UTF-8, PostgreSQL sorts characters in this order:
1. Punctuation marks, including quotes, parentheses, and math operators
2. Numbers 0 - 9
3. Additional punctuation, including the question mark
4. Capital letters from A - Z
5. More punctuation, including brackets and underscore
6. Lowercase letters a - z
7. Additional punctuation, special characters, and the extended alphabet

We can order multiple columns as well:
```
SELECT last_name, school, hire_date
FROM teachers
ORDER BY school ASC, hire_date DESC;
```
By sorting the `school` column in ascending ordr and `hire_date` in descending order, we create a listing of teachers grouped by school with the most recently hired teachers listed first. This can show us who the nearest teachers are at each school.

## 2.3 Filtering Rows with `WHERE`
---

Sometimes you'll want to limit the rows a query returns to only those in which one or more columns meet cdrtain criteria. Use the `WHERE` clause which should follow the `FROM` clause.
```
SELECT last_name, school, hire_date
FROM teachers
WHERE school = 'Myers Middle School';
```
The result should show just the teachers assigned to Myers Middle School.

|Operator|Function|Example|
|--------|--------|-------|
|=|Equal to|WHERE school = 'Baker Middle'|
|<> or !=|Not equal to*|WHERE school <> 'Baker Middle'|
|>|Greater than|WHERE salary > 20000|
|<|Less than|WHERE salary < 60500|
|>=|Greater than or equal to|WHERE salary >= 20000|
|<=|Less than or equal to|WHERE salary <= 60500|
|BETWEEN|Within a range|WHERE salary BETWEEN 20000 AND 40000|
|IN|Match one of a set of values|WHERE last_name IN ('Bush','Roush')|
|LIKE|Match a pattern (case sensitive)|WHERE first_name LIKE 'Sam%'|
|ILIKE*|Match a pattern (case insensitive)|WHERE first_name ILIKE 'sam%'|
|NOT|Negates a condition|WHERE first_name NOT ILIKE 'sam%'|

*The `!=` operator is not part of standard ANSI SQL but is available in PostgreSQL and other database systems

*PostgreSQL only

Examples:

Using the equals operator to find teachers whose first name is Janet:
```
SELECT first_name, last_name, school
FROM teachers
WHERE first_name = 'Janet';
```

List all school names in the table but exclude F.D. Roosevelt HS using not equal operator:
```
SELECT school
FROM teachers
WHERE school <>'F.D. Roosevelt HS';
```

Using the less than operator to list teachers hired before January 1, 2000 (yyyy-mm-dd):
```
SELECT first_name, last_name, hire_date
FROM teachers
WHERE hire_date < '2000-01-01';
```

Finding teachers who earn $43,500 or more using the greater than or equal to operator:
```
SELECT first_name, last_name, salary
FROM teachers
WHERE salary >= 43500;
```

Finding teachers who earn between $$40,000 and $65,000 inclusive:
```
SELECT first_name, last_name, salary
FROM teachers
WHERE salary BETWEEN 40000 AND 65000;
```

## USING `LIKE` and `ILIKE` with `WHERE`

Both `LIKE` and `ILIKE` let you search for patterns in strings by using two special characters:
- **Percent sign (`%`)** : a wildcard matching one or more characters
- **Underscore (`_`)** : a wildcard matching just one character

For instance, if you're trying to find the word `baker`, the lowing `LIKE` patterns will match it:
```
LIKE 'b%'
LIKE '%ak%'
LIKE '_aker'
LIKE 'ba_er'
```

`LIKE` which is apart of the ANSI SQL standard, is case sensitive. `ILIKE`, which is a PostgreSQL-only implementation, is case insensitive.

The first `WHERE` clause uses `LIKE` and should return zero results since all names are capitalized. The second will return two names since it uses the case insensitive `ILIKE`.
```
SELECT first_name
FROM teachers
WHERE first_name LIKE 'sam%';
```
```
SELECT first_name
FROM teachers
WHERE first_name ILIKE `sam%';
```

## Combinging Operators with `AND` and `OR`

Comparaison operators become even more useful when we combine them using keywords `AND` and `OR` along with parentheses if needed.

Examples:
```
SELECT *
FROM teachers
WHERE school = 'Myers Middle School'
    AND salary < 40000;
```
```
SELECT *
FROM teachers
WHERE last_name = 'Cole'
    OR last_name = 'Bush';
```
```
SELECT *
FROM teachers
WHERE school = 'F.D. Roosevelt HS'
    AND (salary < 38000 OR salary > 40000);

## 2.4 Putting It All Together
---

You can combine comparision operator statements and the `ORDER BY` clause together to rank results. SQL is particular about the ordering of keywords, so follow this convention:
```
SELECT column_names
FROM table_name
WHERE criteria
ORDER BY column_names;
```

This query returns teachers at Roosevelt High School, ordered from newest hire to earliest. We can see a clear correlation between a teacher's hire date at the school and his or her current salary level:
```
SELECT first_name, last_name, school, hire_date, salary
FROM TEACHERS
WHERE school LIKE '%Roos%'
ORDER BY hire_date DESC;
```

# Chapter 3 : Understanding Data Types

Whenever met with a new database, check the *data type* specified for each column in each table. If lucky, you can find a ***data dictionary*** : a document that lists each column; specifies whether it's a number, character, or other type; and explains the column values.

Unfortunately, many organizations don't create and maintain good documentation, so it's not unsual to not find one. In that case, try to learn by inspecting table structures.

It's important to understand data types because sorting data in the oppropriate format is fundamental to building usable databases and performing accurate analysis.

In a SQL database, each column in a table can hold *one and only one* data type, which is defined in the `CREATE TABLE` statement. You declare the data type after naming the column.

Declare the data type after naming the columnl:
```
CREATE TABLE eagle_watch (
    observed_date date,
    eagles_seen integer
);
```

There are three cateories which appear the most:
- **Characters** : any character or symbol
- **Numbers** : includes whole numbers and fractions
- **Dates and Times** : types holding temporal information

## 3.1 Characters
---

*Character string types* are general-purpose types suitable for any combination of text, numbers, and symbols.

***`char(n)`***
- A fixed-length column where the character length is specified by `n` If the inputed text is less than `n`, standard SQL (including PostgreSQL) will pad the rest of that input with spaces. This is used infrequently nowadays.
- For standard SQL, use `character(n)`.

***`varchar(n)`***
- A variable-length column where the *maximum* length is specified by `n`. If you insert fewer characters than the maximum, PostgreSQL and standard SQL will not store extra spaces. In large databases, this practice saves considerable space.
- For standard SQL, use `character varying(n)`

***`text`***
- A variable-length column of unlimited length. (According to PostgreSQl documentation, the longest possible character string you can store is about 1 gigabyte). The `text` type is not part of the SQL standard, but there exist similar implementations.

## 3.2 Numbers
---

Number columns can hold various types of numbers, but they also allow you to perform calculations on those numbers while strings in character form cannot. There are integers and fixed- / floating-point numbers.

### Integers

Integer data types are the most common number types. These are whole numbers, both positive and negative, including zero.

The standard SQL provides three integer types: `smallint`, `integer`, and `bigint`. The difference between the types is the maximum size of the numbers they can hold.

|Data type|Storage size|Range|
|---------|------------|-----|
|`smallint`|2 bytes|-32,768 to +32,767|
|`integer`|4 bytes|-2,147,483,648 to +2,147,483,647|
|`bigint`|8 bytes|−9,223,372,036,854,775,808 to +9,223,372,036,854,775,807|

Even though it uses the most stoarge, `bigint` is essential if you're working with numbers larger than 2.1 billion. Otherwise if certain on the number size, `integer` will be better. When data is constrained, `smallint` will be the best.

If you try to insert a number into any of these columns that is outside its range, the database will stop the operation and return an `out of range` error.

### Auto-Incrementing Integers

In Ch 1, we saw `bigserial`, this and its siblings `smallserial`, and `serial` are a special *implementation* of the corresponding `smallint`, `integer`, and `bigint` types. A column with a serial type will *auto-increment* the value in the column each time you insert a row, starting with 1, up to the max of each integer type while using PostgreSQL.

The serial types are implementations of the ANSI SQL standard for auto-numbered *identity columns*. Each database manager implements these in its own way.

To use a serial type on a column, declare it in the `CREATE TABLE` statement as you would an integer type.

|Data type|Storage|Range|
|---------|-------|-----|
|`smallserial`|2 bytes|1 to 32,767|
|`serial`|4 bytes|1 to 2,147,483,647| 
|`bigserial`|8 bytes|1 to 9,223,372,036,854,775,807|

### Decimal Numbers

Deciamsl represent a whole number plus a fraction of a whole number; the fraction is represented by digits following a decimal point. In a SQL database, they're handled by *fixed-point* and *floating-point* data types. The difference is in how the computer stores the data.

#### Fixed-Point Numbers

The *fixed-point* type, also called the *arbitrary precision* type, is `numeric(precision, scale)`. You give the arument `precision` as the maximum number of digits to the left and right of the decimal oint, and the argument `scale` as the number on the right of the decimal point. You can also use `decimal(precision, scale)`.

If you omit specifying a `scale` value, the scale will be set to 0, which in effect creates an integer.

If you omit specifying the `precision` and the `scale`, the database will store values of any precision and scale up to the maximum allowed.

Example : `numeric(5 , 2)` will allow 5 digits total (precision) and 2 digits right of the decimal point (scale). So 1.47, 1.00, and 121.50 are allowed.

#### Floating-Point Types

There are two floating-point types: `real` and `double precision`. The difference is how much data they store.
- `real` : precision to six decimal digits
- `double precision` : precision to 15 decimal digits

These are also called `variable-precision` types. The database stores numbers in parts representing the digits and an exponent - the location where the decimal point belongs. So unlike `numeric`, where we specify fixed precision and scale, the decimal point in a given column can "float" depending on the number.

#### Using Fixed- and Floating-Point Types

Each type has differing limits on the number of total digits, or precision, it can hold.

|Data type|Storage size|Storage type|Range|
|---|---|---|---|
|`numeric`,`decimal`|variable|Fixed-point|Up to 131072 digits before the decimal point; up to 16383 digits after the decimal point|
|`real`|4 bytes|Floating-point|6 decimal digits precision|
|`double precision`|8 bytes|Floating-point|15 decimal digits precision|

#### Trouble with FLoating-Point Math

The way computers store floating-point numbers can lead to unintended mathematical errors. Floating-point math produces errors because the computer attempts to squeeze lots of info into a finite number of bits.

### Choosing Your Number Data Type

1. Use integers when possible. Unless your data uses decimals, stick with integer types.
2. If you're working with decimal data and need calculations to be exact (dealing with money, for example), choose `numeric` or its equivalent `decimal`. Float types will save space, but the inexactness of floating-point math won't pass muster in many applications. Use them only when exactness is not as important.
3. Choose a big enough number type. Unless you're designing a database to hold millions of rows, err on the side of bigger. When using `numeric` or `decimal`, set the precision large enough to accomodate the number of digits on both sides of the decimal. With whole numbers, use `bigint` unless you're absolutely sure column values will be constrained to fit into the smaller `integer` or `smallint` types.

## 3.3 Dates and Times
---

Databases have awareness of the current time plus the ability to handle formats for dates, times, and the nuances of the calendar, such as leap years and time zones.

|Data type|Storage size|Description|Range|
|---------|------------|-----------|-----|
|`timestamp`|8 bytes|Date and time|4713 BC to 294,276 AD|
|`date`|4 bytes|Date (no time)|4713 BC to 5,874,897 AD|
|`time`|8 bytes|Time (no date)|00:00:00 to 24:00:00|
|`interval`|16 bytes|Time interval|+/- 1780,000,000 years|

- **`timestamp`** : records date and time, useful for range of situations. Typically, you'll want to add the keywords `with time zone` to ensure that the time recorded for an event includes the time zone where it occured.
- **`date`** : records just the date
- **`time`** : records just the time. Probably want to add `with time zone`.
- **`interval`** : holds a value representing a unit of time expressed in the format `quantity unit`. It doesn't record the start or end of a time period, only its length

### Using the `interval` Data Type  in Calculations

The `interval` data type is useful for easy-to-understand calculations on date and time data. FOr example, let's say you have a column that holds the date a client signed a contact. Using the interval data, you can add 90 days to each contract date to determine when to follow up with the client.

## 3.4 Miscellaneous Types
---

- A boolean type that stores a value of `true` or `false`
- Geometric types that include points, lines, circles, and other 2-d objects
- A Universally Unique Identifier (UUID) type, sometimes used as a unique key value in tables
- XML and JSON data types that store information in those structured formats

## 3.5 Transforming Values from One Type to Another with `CAST`
---

Occasionally, you may need to transform a value from its stored data type to another type. You can do this using the `CAST()` function.

The `CAST()` function only works when the target data type can accomodate the original value. Casting an integer as text is possible but not the other way around.

The first two examples work but the third will not.
```
SELECT timestamp_column, CAST(timestamp_column AS varchar(10))
FROM date_time_types;
```
```
SELECT numeric_column,
    CAST(numeric_column AS integer),
    CAST(numeric_column AS varchar(6))
FROM number_data_types;
```
```
SELECT CAST(char_column AS integer) FROM char_data_types;
```

### `CAST` Shortcut Notation

Using `CAST()` is obvious and is readable. But for PostgreSQL, there is a less-obvious notation that takes less space, the *double colon* `::`.

Insert the double colon in between the name of the column and the data type you want to convert it to. Both of these do the same thing.
```
SELECT timestamp_column, CAST(timestamp_column AS varchar(10))
FROM date_time_types;
```
```
SELECT timestamp_column::varchar(10)
FROM date_time_types;
```

# Chapter 4 : Importing and Exporting Data